// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "聂友园小可爱",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "今天是你的生日",  // 同上...
        "愿你贪吃不胖",
        "愿你永远健康依旧美好",
        "愿你做过的美梦都实现",
        "愿你永远都有好运气",
        "愿你一生简单一生幸福",
        "愿你平安、健康、快乐",
        "祝愿要哄的仙女园",
        "生日快乐 天天开心",
        "比心~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        //"心爱的小可爱": "./imgs/xiaokeai.png",
        "聂友园小可爱": "./imgs/001.jpg",  
        "今天是你的生日": "./imgs/002.jpg",  
        "愿你贪吃不胖": "./imgs/003.jpg",
        "愿你永远健康依旧美好": "./imgs/004.jpg",
        "愿你做过的美梦都实现": "./imgs/005.jpg",
        "愿你永远都有好运气": "./imgs/006.jpg",
        "愿你一生简单一生幸福": "./imgs/007.jpg",
        "愿你平安、健康、快乐": "./imgs/008.jpg",
        "祝愿要哄的仙女园": "./imgs/009.jpg",
        "生日快乐 天天开心": "./imgs/010.jpg",
        "比心~~": "./imgs/011.jpg",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开灯",
        play: "音乐",
        bannar_coming: "庆祝一下",
        balloons_flying: "气球",
        cake_fadein: "蛋糕",
        light_candle: "点亮蜡烛",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
